In [1]:
from g2json import get_gdoc
import Quandl as q
import pandas as pd
from datetime import date 
from datetime import timedelta

days = 400/5*7
print days
d = date.today() - timedelta(days=days)
start_date = d.strftime('%Y-%m-%d')
print start_date

560
2013-09-04

In [2]:
symbols =  pd.read_json(get_gdoc("1Vbgw4yw1crruuH05aDSHXBvD_Bb_Tq47Fs04MNJVDk4","Symbols",return_json=True))

In [3]:
symbols.columns

Index([u'__rowid__', u'code', u'contractmonths', u'contractname', u'database', u'exchange', u'market', u'source', u'symbol'], dtype='object')

In [4]:
data = None
for i, row in symbols.iterrows():
    month = "1"
    search = "{0}/{1}_{2}{3}".format(row.database, row.source, row.symbol, month)
#     print search
    frequency = "daily"
    
    df = q.get(search, authtoken="xkXtzxzRcDyizWAV9r3_", 
               collapse=frequency,
               sort_order="asc", 
               trim_start=start_date)
    
    df['Symbol'] = row.symbol
    
    if (data is not None):        
        data = data.append(df, ignore_index=False)
        print 'appending {0} {1}, {2} rows ({3})'.format(row.contractname, df.Symbol[0], len(df.index), len(data.index))
    else:
        # first time around?
        data = df
        print 'initializing {0} {1}, {2} rows ({3})'.format(row.contractname, df.Symbol[0], len(df.index), len(data.index))
        
#     print df.columns

initializing Cocoa Futures CC, 388 rows (388)
appending Coffee C Futures KC, 384 rows (772)
appending Corn Futures C, 386 rows (1158)
appending Cotton No. 2 Futures CT, 388 rows (1546)
appending Feeder Cattle Futures FC, 382 rows (1928)
appending Lean Hog Futures LN, 384 rows (2312)
appending Live Cattle Futures LC, 386 rows (2698)
appending Oats Futures O, 382 rows (3080)
appending Orange Juice Futures OJ, 388 rows (3468)
appending Random Length Lumber Futures LB, 380 rows (3848)
appending Soybean Futures S, 386 rows (4234)
appending Soybean Meal Futures SM, 386 rows (4620)
appending Soybean Oil Futures BO, 386 rows (5006)
appending Sugar No. 11 Futures SB, 387 rows (5393)
appending Wheat Futures W, 386 rows (5779)
appending Australian Dollar Futures AD, 386 rows (6165)
appending British Pound Futures BP, 386 rows (6551)
appending Canadian Dollar Futures CD, 385 rows (6936)
appending Euro FX Futures EC, 386 rows (7322)
appending Japanese Yen Futures JY, 385 rows (7707)
appending Mexican Peso Futures MP, 384 rows (8091)
appending New Zealand Dollar Futures NE, 386 rows (8477)
appending Swiss Franc Futures SF, 386 rows (8863)
appending US Dollar Index Futures DX, 394 rows (9257)
appending Brent Crude Oil Futures BB, 268 rows (9525)
appending Crude Oil Futures CL, 386 rows (9911)
appending E-mini Natural Gas Futures QG, 266 rows (10177)
appending Heating Oil Futures O, 394 rows (10571)
appending RBOB Gasoline Physical Futures RB, 386 rows (10957)
appending E-mini Dow ($5) Futures YM, 384 rows (11341)
appending E-mini NASDAQ 100 Futures NQ, 385 rows (11726)
appending E-mini S&P 500 Futures ES, 386 rows (12112)
appending Nikkei/USD Futures NK, 386 rows (12498)
appending Russell 2000 Index Mini Futures TF, 394 rows (12892)
appending Copper Futures HG, 382 rows (13274)
appending Gold Futures GC, 385 rows (13659)
appending Palladium Futures PA, 386 rows (14045)
appending Platinum Futures PL, 386 rows (14431)
appending Silver Futures SI, 386 rows (14817)
appending 10 Yr Note Futures TY, 386 rows (15203)
appending 2 Yr Note Futures TU, 386 rows (15589)
appending 5 Yr Note Futures FV, 386 rows (15975)
appending U.S. Treasury Bond Futures US, 385 rows (16360)

In [12]:
len(data.index)

16360

In [38]:
# ['Symbol','Settle']
# df[df['A'] > 0]
d = data[['Settle']][data['Symbol'] == 'C'].sort()
d

            Settle
Date
2013-09-04  494.00
2013-09-05  489.50
2013-09-06  491.50
2013-09-09  477.25
2013-09-10  474.75
2013-09-11  479.75
2013-09-12  479.00
2013-09-13  450.00
2013-09-16  456.50
2013-09-17  454.00
2013-09-18  456.25
2013-09-19  459.50
2013-09-20  451.00
2013-09-23  453.25
2013-09-24  448.75
2013-09-25  454.75
2013-09-26  456.75
2013-09-27  454.00
2013-09-30  441.50
2013-10-01  439.00
2013-10-02  439.00
2013-10-03  439.25
2013-10-04  443.25
2013-10-07  449.25
2013-10-08  441.75
2013-10-09  443.50
2013-10-10  438.25
2013-10-11  433.25
2013-10-14  437.00
2013-10-15  443.50
...            ...
2015-02-03  385.50
2015-02-04  383.00
2015-02-05  385.50
2015-02-06  385.50
2015-02-09  391.50
2015-02-10  388.00
2015-02-11  385.50
2015-02-12  383.00
2015-02-13  387.50
2015-02-17  389.00
2015-02-18  383.50
2015-02-19  389.50
2015-02-20  385.50
2015-02-23  378.50
2015-02-24  377.00
2015-02-25  375.50
2015-02-26  380.00
2015-02-27  384.00
2015-03-02  378.50
2015-03-03  382.00
2015-03-04  381.00
2015-03-05  382.50
2015-03-06  379.50
2015-03-09  383.50
2015-03-10  382.50
2015-03-11  384.00
2015-03-12  382.25
2015-03-13  380.50
2015-03-16  379.00
2015-03-17  371.00

[386 rows x 1 columns]

In [39]:
d['ma'] = pd.rolling_mean(d, 50)

In [40]:
import plotly.plotly as py
from plotly.graph_objs import *
import plotly.tools as tls
tls.set_credentials_file(username='claus', api_key='bv1zgby5ci')

In [41]:
close = Scatter(
    x=d.index,
    y=d.Settle
)

ma = Scatter(
    x=d.index,
    y=d.ma
)

In [42]:
plot_url = py.plot(Data([close,ma]), filename='basic-line')

In [4]:
import MySQLdb

In [42]:
db = MySQLdb.connect("localhost","root","","calogica" )

In [43]:
# cursor = db.cursor()

# # execute SQL query using execute() method.
# cursor.execute("SELECT VERSION()")

In [44]:
# data = cursor.fetchone()

# print "Database version : %s " % data

In [45]:
# db.close()

In [46]:
tbl = pd.read_sql('select * from test;', con=db)    
print 'loaded dataframe from MySQL. records:', len(tbl)
tbl.head()

loaded dataframe from MySQL. records: 13

   id   name
0   1  claus
1   1      a
2   2      b
3   3      c
4   4      d

In [63]:
d = {'name' : ['a', 'b', 'c', 'd']}
new_data = pd.DataFrame(d, index=[1., 2., 3., 4.])
new_data.index.names = ['id']
new_data.columns = ['name']
print new_data
o = new_data.to_sql(con=db, name='new_tbl', if_exists='append', flavor='mysql')
# print o

   name
id
1     a
2     b
3     c
4     d

In [62]:
tbl = pd.read_sql('select * from test;', con=db)    
print 'loaded dataframe from MySQL. records:', len(tbl)
tbl

loaded dataframe from MySQL. records: 12

    id name
0    1    a
1    2    b
2    3    c
3    4    d
4    1    a
5    2    b
6    3    c
7    4    d
8    1    a
9    2    b
10   3    c
11   4    d

In [67]:
import MySQLdb

# change your server, login and db
db = MySQLdb.connect("localhost","root","","calogica" )

# create a dataframe with some sample data
d = {'name' : ['a', 'b', 'c', 'd']}
new_data = pd.DataFrame(d, index=[1., 2., 3., 4.])
print new_data

# rename the index column
new_data.index.names = ['id']

# creates a new table on the fly if it doesn't exist. Other optons are 'replace' or 'fail'
new_data.to_sql(con=db, name='new_tbl', if_exists='append', flavor='mysql')

# magically all the dataz are in there
tbl = pd.read_sql('select * from new_tbl;', con=db)    
print tbl.name

  name
1    a
2    b
3    c
4    d
0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
Name: name, dtype: object

In [68]:
db.close()